Console.Clear();
//-постановка задачи
void TZ()
{
    Console.WriteLine("Написать программу, \n" +
                "!1! - которая из имеющегося массива строк \n" +
                "!2! - формирует новый массив из строк, \n" +
                "!3! - длина которых меньше, либо равна 3 символам.\n" +
                "!4-!выбор! - Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.\n" +
                "!5-ограничение!- При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.");
}
TZ();


